backend/results/simple-stress-test/ab-summary-Java21_G1GC-20250830_184140.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/health
Document Length:        398 bytes

Concurrency Level:      50
Time taken for tests:   0.907 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      396000 bytes
HTML transferred:       199000 bytes
Requests per second:    551.16 [#/sec] (mean)
Time per request:       90.717 [ms] (mean)
Time per request:       1.814 [ms] (mean, across all concurrent requests)
Transfer rate:          426.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       6
Processing:    16   87  34.0     84     227
Waiting:       15   87  33.9     84     227
Total:         16   88  34.0     84     227

Percentage of the requests served within a certain time (ms)
  50%     84
  66%     99
  75%    109
  80%    118
  90%    135
  95%    146
  98%    170
  99%    181
 100%    227 (longest request)