backend/results/simple-stress-test/ab-summary-Java21_UltraLow-20250830_184140.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/health
Document Length:        398 bytes

Concurrency Level:      50
Time taken for tests:   0.975 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      396000 bytes
HTML transferred:       199000 bytes
Requests per second:    513.02 [#/sec] (mean)
Time per request:       97.462 [ms] (mean)
Time per request:       1.949 [ms] (mean, across all concurrent requests)
Transfer rate:          396.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      13
Processing:    15   93  47.7     80     301
Waiting:       15   93  47.7     80     301
Total:         16   94  47.8     80     302

Percentage of the requests served within a certain time (ms)
  50%     80
  66%    100
  75%    113
  80%    124
  90%    158
  95%    194
  98%    239
  99%    264
 100%    302 (longest request)