backend/results/simple-stress-test/ab-summary-Java21_ZGC-20250830_184140.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/health
Document Length:        398 bytes

Concurrency Level:      50
Time taken for tests:   0.947 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      396000 bytes
HTML transferred:       199000 bytes
Requests per second:    528.05 [#/sec] (mean)
Time per request:       94.688 [ms] (mean)
Time per request:       1.894 [ms] (mean, across all concurrent requests)
Transfer rate:          408.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:    15   91  48.1     82     373
Waiting:       14   91  48.1     82     372
Total:         15   92  48.2     83     373

Percentage of the requests served within a certain time (ms)
  50%     83
  66%     93
  75%    105
  80%    115
  90%    143
  95%    175
  98%    271
  99%    295
 100%    373 (longest request)